// import 'dart:convert';
// import 'package:http/http.dart' as http;

var timeTable = [
  // {
  //   '节次': '节次',
  //   '课程': '课程',
  //   '教室': '教室',
  //   '教师': '教师',
  //   '教学方式': '教学方式',
  // },
  {
    '节次': '1-2',
    '课程': '离散数学',
    '教室': '信息科学与技术学院230室',
    '教师': '周俊萍',
    '教学方式': '定时答疑',
  },
  {
    '节次': '3-4',
    '课程': '数字逻辑与数字系统',
    '教室': '信息科学与技术学院230室',
    '教师': '张日明',
    '教学方式': '定时答疑',
  },
  {
    '节次': '5-6',
    '课程': '',
    '教室': '',
    '教师': '',
    '教学方式': '',
  },
  {
    '节次': '7-8',
    '课程': '',
    '教室': '',
    '教师': '',
    '教学方式': '',
  },
  {
    '节次': '9-10',
    '课程': '',
    '教室': '',
    '教师': '',
    '教学方式': '',
  },
  {
    '节次': '11-12',
    '课程': '',
    '教室': '',
    '教师': '',
    '教学方式': '',
  },
];

var data = [
  [
    {
      '节次': '节次',
      '课程': '课程',
      '教室': '教室',
      '教师': '教师',
      '教学方式': '教学方式',
    },
    {
      '节次': '1-2',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '3-4',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '5-6',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '7-8',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '9-10',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '11-12',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
  ],
  [
    {
      '节次': '节次',
      '课程': '课程',
      '教室': '教室',
      '教师': '教师',
      '教学方式': '教学方式',
    },
    {
      '节次': '1-2',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '3-4',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '5-6',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '7-8',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '9-10',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
    {
      '节次': '11-12',
      '课程': '',
      '教室': '',
      '教师': '',
      '教学方式': '',
    },
  ],
];
